M.w(`
<p>โปรแกรม DIYPOS  V0.6 นี้ คือโปรแกรมขายหน้าร้าน 
<br />เป็นโปรแกรมประเภท Web Application (ใช้งานผ่านหน้าเว็บไซต์) ติดตั้งที่เครื่องผู้ใช้
<br />เขียนด้วย (ขณะที่พัฒนาโปรแกรม) 
<br />	PHP 8.0.7 ,
<br />	MariaDB 10.4.19,
<br />	HTML 5,
<br />	CSS 3,
<br />	JavaScript
<br />โดยจำลอง เครื่องผู้ใช้ เป็น Web Sever ด้วย XAMPP  เรียกใช้งานโปรแกรมผ่านทาง Web Browser 
<br />จากอุปกรณ์ต่างๆ ที่ใช้เครือค่ายอินเทอเนตในวงเดียวกัน โดยไม่ต้องต่ออินเทอเนต ภายนอก
<br />โดยขณะที่พัฒนาโปรแกรม จะทดลอง และทดสอบกับ Web Browser 3 ค่าย ดังนี้ 
<br />(เข้าถึงได้หลายระบบปฏิบัติการ Windows,Linux,Mac,Android)
<br />	1.Firefox 89.0.1 (64-bit)
<br />	2.Opera 74.0.3911.218
<br />	3.Chrome 91.0.4472.114 (Official Build) (64-bit)</p>
`)
M.select()

