M.select()
/*M.w(`
<p>หลังติดตั้งเสร็จ เริ่มทำตามดังนี้</p>
<ol>
	<li>เปลี่ยนรหัสผ่านใหม่สำหรับผู้ดูแลระบบ</li>
	<li>เพิ่มผู้ใช้ ไวใช้งาน</li>
	<li>กรอกข้อมูล คู่ค้า ไว้เลือก</li>
	<li>กรอกข้อมูล หน่วยสินค้า ไว้เลือก</li>
	<li>กรอกข้อมูล คุณสมบัติสินค้าสินค้า ไว้เลือก</li>
	<li>กรอกข้อมูล กลุ่มสินค้า ไว้เลือก</li>
	<li>กรอกข้อมูล คลังสินค้าสินค้า ไว้เลือก</li>
	<li>กรอกข้อมูล สินค้า ไว้เลือก</li>
	<li>กรอกข้อมูล รูปแบบการชำระ ไว้เลือก</li>
	<li>กรอกข้อมูล นำเข้าสินค้า ไว้เลือก</li>
	<li>ตั้งค่าข้อมูลร้านค้า</li>
	<li>ตั้งค่าเครื่องพิมพ์</li>
</ol>
`)*/
