let head=M.ob_page[M.s_page].nt
let msg=""
let img=[
	"use_first_add-printer_02.png",
		`ตัวอย่าง
		<br />ต้องการใช้เครื่องที่งลงโปรแกรม เป็นจุดขายในตัว <br><br>(Windows 10) ผมจะใช้ฟ้อนต์ในเครื่อง C:\\Windows\\Fonts\\tahomabd.ttf  <br><br>เครื่องพิมพ์แบบฉีกต่ออยู่กับ พอร์ต COM17 <br><br>ต้องการให้เปิดลิ้นชักอัตโนมัติ<br><br>ชดเชยบรรทัดว่างไว้ 2 บรรทัด (ไม่ชดเชยก็ได้ แต่ต้องกดปุ่ม feed จากเครื่องพิมพิ์)<br><br>จากภาพตัวอย่างก็จะได้การตั้งค่าดังนี้
		<code class="code">{
  "font_0":"C:\\\\Windows\\\\Fonts\\\\tahomabd.ttf",
  "font_1":"C:\\\\Windows\\\\Fonts\\\\tahomabd.ttf",
  "font_0_size":18,
  "font_1_size":18,
  "printer_0":{
    "status":1,
    "name":"เครื่องพิมพ์ปริยาย 58มม. USB",
    "width":58,
    "address":"COM17",
    "cut":0,
    "pulse":1,
    "feed":2,
    "_ucda":"",
    "_ucdp":0
  },
}</code>*ระวังเครื่องหมาย \\ ที่อยู่ไฟล์ ต้องเพิ่มไปอีก 1 อัน เป็น \\\\`,
	"use_first_add-printer_03.png",
		`ตัวอย่าง
		<br />ต้องการใช้เครื่องที่งลงโปรแกรม เป็นจุดขายในตัว 
		(Windows 10) และมีจุดขายเพิ่มมา 1 จุด 
		<br><br>ผมจะใช้ฟ้อนต์ในเครื่อง C:\\Windows\\Fonts\\tahomabd.ttf  
		<br><br>${M.v_s("P0")} เครื่องพิมพ์แบบฉีกต่ออยู่กับ พอร์ต COM7 
		<br>${M.v_s("P1")} เครื่องพิมพ์แบบตัดกระดาษได้ IP 192.168.1.99 พอร์ต 9100
		<br><br>ต้องการให้เปิดลิ้นชักอัตโนมัติ<br><br>ชดเชยบรรทัดว่างไว้ 2 บรรทัด (ไม่ชดเชยก็ได้ แต่ต้องกดปุ่ม feed จากเครื่องพิมพิ์)<br><br>จากภาพตัวอย่างก็จะได้การตั้งค่าดังนี้
		<code class="code">{
  "font_0":"C:\\\\Windows\\\\Fonts\\\\tahomabd.ttf",
  "font_1":"C:\\\\Windows\\\\Fonts\\\\tahomabd.ttf",
  "font_0_size":18,
  "font_1_size":18,
  "printer_0":{
    "status":1,
    "name":"เครื่องพิมพ์ปริยาย 58มม. USB",
    "width":58,
    "address":"COM7",
    "cut":0,
    "pulse":1,
    "feed":2,
    "_ucda":"",
    "_ucdp":0
  },
  "printer_1":{
    "status":1,
    "name":"P1 เครื่อง 58มม. WIFI",
    "width":58,
    "address":"192.168.1.99:9100",
    "cut":1,
    "pulse":1,
    "feed":2,
    "_ucda":"",
    "_ucdp":0
  },
}</code>*ระวังเครื่องหมาย \\ ที่อยู่ไฟล์ ต้องเพิ่มไปอีก 1 อัน เป็น \\\\`,
	"use_first_add-printer_19.png",
		"สามารถสั่งพิมพ์ออกได้ทุเครื่องพิมพ์",
	"use_first_add-printer_20.png",
		"สามารถสั่งพิมพ์ออกได้ทุเครื่องพิมพ์"
]


M.blockHead(head)
M.blockStep(
	head,
	`<img src="img/use_first_add-printer_01.png" onclick="M.viewImg(this)"/>
	<br />ในแฟ้มโปรแกรม ดูที่ไฟล์ set/printer.json
	<code class="block">
	<p>${M.v_s("font_0")} คือ ที่อยู่ฟ้อนต์สำหรับพิมพ์ใบเสร็จ .ttf (ฟ้อนต์ในใบเสร็จจะแคบกว่าปกติเหลือ 66.666666...%)</p>
	<p>${M.v_s("font_1")} คือ ที่อยู่ฟ้อนต์สำหรับพิมพ์อื่นๆ .ttf เช่น ป้ายแสดงราคาสินค้า</p>
	<p>${M.v_s("font_0_size")} คือ ขนาดฟ้อนค์ของ font_0</p>
	<p>${M.v_s("font_1_size")} คือ  คือ ขนาดฟ้อนค์ของ font_1</p>
	<b>"printer_n":{</b> คือ ชื่อตัวแปร printer n คือลำดับ เริ่มจาก 0 แล้วเพิ่มทีละ 1 โดย printer_0 เป็นเครื่องพิมพ์ปริยาย </p>
		<p>&nbsp; &nbsp;${M.v_s("status")} คือ เปิดปิดการใช้งาน 0=ปิด , 1=เปิด</p>
		<p>&nbsp; &nbsp;${M.v_s("name")} คือ	ชื่อเครื่องพิมพ์ที่ตั้งเอง </p>
		<p>&nbsp; &nbsp;${M.v_s("width")} คือ ความกวางกระดาษ มีค่า 58 อย่างเดียว </p>
		<p>&nbsp; &nbsp;${M.v_s("address")} คือ ที่อยู่ เครื่องพิมพ์ </p>
		<p>&nbsp; &nbsp;${M.v_s("cut")} คือ ให้ตัดกระดาษหรือไม่ 0=ไม่ตัด ,1=ตัด (เครื่องที่ไม่มีระบบตัดกระดาษใส่ 0 เท่านั้น)</p>
		<p>&nbsp; &nbsp;${M.v_s("pulse")}  คือ ให้เปิดลิ้นชักหรือไม่ 0=ไม่เปิด ,1=เปิด</p>
		<p>&nbsp; &nbsp;${M.v_s("feed")}  คือ บรรทัดว่างชดเชนท้ายใบเสร็จ </p>
		<p>&nbsp; &nbsp;${M.v_s("_ucda")}  คือ ที่อยู่สำหรับ ลิ้นชัก กรณีที่เชื่อมต่อลิ้นชักกับ คอมพิวเตอร์ ไม่ได้เชื่อมต่อกับเครื่องพิมพ์</p>
		<p>&nbsp; &nbsp;${M.v_s("_ucdp")}  คือ การกำหนดการเปิดลิ้นชัก สำหรับ กรณีที่เชื่อมต่อลิ้นชักกับ คอมพิวเตอร์ ไม่ได้เชื่อมต่อกับเครื่องพิมพ์ 0 = ปิดใช้การเปิดลิ้นชัก, 1 = เปิดใช้การเปิดลิ้นชัก</p>
	<b>}</b>
	</code>
	<p>*รองรับเครื่องพมพ์ 58 มม. ถ้าเป็นแบบ ถ้าใช้ขนาด 80 มม. ก็ได้อยู่แต่จะเหลือพื้นที่ว่างด้านขวาขาวๆ USB เสียบคอมได้เลย แล้วดูว่าอยู่ Port อะไร ถ้าเป็นเครื่องพิมพ์ที่เชื่อมต่อด้วย ไวไฟ จะต้องไปตั้งค่า IP และ Port ให้กับเครื่องก่อน ซึ่งต้องมีโปรแกรมจัดการ การตั้งค่าของเครื่องพิมพ์นั้นๆ</p>
	<p>*${M.link_s("หาที่อยู่ฟ้อนต์ ใน Windows 10","?page=technic_find-font-path-window")}</p>
	<p>* ที่อยู่ฟ้อน ของ Linux Light ==&gt; <b>/usr/share/fonts/</b></p>
	<p>*เครืองพิมพ์ทุกเครื่องถูกสั่งพิมพ์ จากเครื่อง Server (ไม่ได้เชื่อมต่อและสั่งพิมพ์จากเครื่องที่จุดขาย)</p>
	<p>*กรณีใช้เครื่องพิมพ์แบบเชื่อมต่อด้วย USB ต้องลากสายไปเสียบที่เครื่อง Server ถ้าเครื่องพิมพ์อยู่จากเครื่อง Server 20 เมตร ก็ต้องใช้สาย USB  ยาวไม่น้อกว่า 20 เมตร เพื่อเชื่อมต่อ</p>
	<p>*กรณีใช้เครื่องพิมพ์แบบเชื่อมต่อด้วยสาย LAN ต้องลากสาย LAN ไปเสียบที่เครื่อง Routers ถ้าเครื่องพิมพ์อยู่จากเครื่อง Routers 20 เมตร ก็ต้องใช้สาย LAN ยาวไม่น้อกว่า 20 เมตร เพื่อเชื่อมต่อ</p>
	<br>ข้างล่างต่อไปนี้จะเป็นตัวอย่าง ลองเทียบเคียงดู
	`,
	[img[0],img[1],img[2],img[3]]
)
M.blockStep(
	"ทดสอบพิมพ์",
	``,
	[img[4],img[5],img[6],img[7]]
)
M.sticky()
